//---------------------------------------------подключаемые модули------------------------------------------------------------------------------------

const { Router } = require('express')
const Todo = require('../models/Todo')
const router = Router()
//---------------------------------------------подключаемые модули------------------------------------------------------------------------------------

//---------------------------------------------get запросы(из браузера на сервер)-----------------------------------------------------------------------

router.get('/', async (req, res) => {// первый параметр главная страница, второй call back(делем асинхроной , потому что будет ощатся с базой данных)
//----------------------------------------------получение списка todo во время рендера главной страницы-------------------------------------------------
  const todos = await Todo.find({})
//----------------------------------------------получение списка todo во время рендера главной страницы-------------------------------------------------

  res.render('index', { 
    title: 'Todos list',
    isIndex: true,      
    todos               
  })
})

router.get('/create', (req, res) => {
  res.render('create', {
    title: 'Create todo',
    isCreate: true
  })
})
//---------------------------------------------POST запрос-----------------------------------------------------------------------------------------------
router.post('/create', async (req, res) => {
  const todo = new Todo({
    title: req.body.title
  })

  await todo.save()
  res.redirect('/')
})

router.post('/complete', async (req, res) => {
  const todo = await Todo.findById(req.body.id)

  todo.completed = !!req.body.completed
  await todo.save()

  res.redirect('/')
})
//---------------------------------------------POST запрос-----------------------------------------------------------------------------------------------

//---------------------------------------------get запросы(из браузера на сервер)-----------------------------------------------------------------------

module.exports = router
